1.2 C언어 소개

1960년대 운영체제는 하드웨어에 종속된 언어로 개발되었다. 그래서 하드웨어가 바뀌면 운영체제를 다시 개발해야 하는 불편함이 있었다.
하드웨어에 종속되지 않는 언어가 필요하다.
1970년에 B언어가 나왔지만 목적에는 부적합했다.
1972년에 C언어가 탄생하였다.

C언어 - 유닉스 운영체제를 만드는데 사용된 언어
C언어는 하드웨어의 세밀한 부분까지 제어가 가능하고 하드웨어에 독립적인 언어이다.

C언어의 4가지 특징
구조화(Strurtured), 이식성(Portability), 확장성, 생산성

A. 구조화된 언어
이전의 언어들은 기존 작업 내용을 재사용하는 것이 힘들었다. 그로 인해 시스템을 유지보수하는 것이 힘들었다.
C언어는 작업 단위를 명확하게 구분하여 유지 보수가 편리하고 기존 코드의 재사용이 편리하다.

B. 이식성이 높다
특정 하드웨어에서 사용하던 프로그램을 다른 하드웨어로 옮겼을 때 프로그램의 변경이 거의 일어나지 않는 것을 이식성이 높다고 한다.

C. 확장성이 좋다
C언어는 다른 언어에 비해 표현법이 더 많고 개발자가 상황에 따라 선택할 수 있는 문법 구조나 표현법이 다양하여 자율성이 높다.

D. 생산성이 높다
경력이 쌓일수록 인프라(명령그룹, 함수)가 다양해져서 프로그램의 개발 속도가 빨라지게 된다.
사용자의 여러가지 요구에 스스로 대처할 수 있어서 프로그램의 완성도와 만족도가 높을 수 밖에 없다.
